# PANDAS WORKSTATION

 Why not excel?? <br>
1. Cannot access big datasets<br>
2. No ML, Data science libraies present for analysis

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\ankit\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ankit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ankit\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ankit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ankit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ankit\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd
import numpy as np

### CREATING DATAFRAMES
#### (Key:Value Pair)   Key = Column, Value = Values of columns

In [39]:
fruit_sales = pd.DataFrame({
    "Apple":[12,20,12,11,34],
    "Mango":[23,34,56,6,56]},
    index = [2024, 2025, 2026, 2027, 2028])

fruit_sales

      Apple  Mango
2024     12     23
2025     20     34
2026     12     56
2027     11      6
2028     34     56

In [40]:
#Dataset formation using dictionary
dict1 ={
    "name":["Ankit", "Billi", "Mango", "Machili"],
    "city":["Darbhangha", "Kolkata", "Tree", "Sea"],
    "Marks":[100,34,12,22],
}

In [7]:
#Assigning variable to the whole dataset for easy usability in code
df = pd.DataFrame(dict1)

In [8]:
df
# here 0,1,2,3... are index/ROW
# here name, city, Marks... are column

      name        city  Marks
0    Ankit  Darbhangha    100
1    Billi     Kolkata     34
2    Mango        Tree     12
3  Machili         Sea     22

In [9]:
#Exporting dataframe to csv file with index
df.to_csv('friendsMarks_index.csv')

In [10]:
#Exporting dataframe to csv file without index
df.to_csv('friendsMarks_noIndex.csv', index=False)

In [11]:
# If data frame to big then look for first n data, where n is the number of data you want to see

#Top n Rows data
df.head(2)

    name        city  Marks
0  Ankit  Darbhangha    100
1  Billi     Kolkata     34

In [12]:
# Last n Rows data
df.tail(2)

      name  city  Marks
2    Mango  Tree     12
3  Machili   Sea     22

In [13]:
# Statistical analysis of numeric/raw data. Useful in numeric data
df.describe()

            Marks
count    4.000000
mean    42.000000
std     39.698866
min     12.000000
25%     19.500000
50%     28.000000
75%     50.500000
max    100.000000

In [14]:
# Reading a csv file
train = pd.read_csv('train.csv')

In [15]:
train

   train num        city  speed
0       1234  Darbhangha    100
1     124567     Kolkata     34
2      96099        Tree     12
3      67634         Sea     22

In [16]:
# Accessing columns or specific value using array slicing

# for accessing just the speed column of train dataset
train['speed']

0    100
1     34
2     12
3     22
Name: speed, dtype: int64

In [17]:
#Accessing and changing specific value using array slicing

#changing value of speed for train number 96099
train['speed'][2] = 120

C:\Users\ankit\AppData\Local\Temp\ipykernel_25132\1514668489.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][2] = 120

In [18]:
train

   train num        city  speed
0       1234  Darbhangha    100
1     124567     Kolkata     34
2      96099        Tree    120
3      67634         Sea     22

In [19]:
# Changing index from 0,1,2,3... to something else
train.index=['first', 'second', 'third', 'fourth']

In [20]:
train

        train num        city  speed
first        1234  Darbhangha    100
second     124567     Kolkata     34
third       96099        Tree    120
fourth      67634         Sea     22

## 2 TYPES OF DATA STRUCTURE IN PANDAS
1. Series - one dimensional array with indexes(0,1,2,3...ora,b,c,d) for later access of elements usingng indexing, it stores a single coloumn/ row of data in a dataframe of a particular datatype such as int, float etc. It is a part of dataframe

2. DataFrame - Two-dimensional array with multiple rows and columns of diiferent kind of datatypes. A tabbular data frame ex.train_dataset used above

In [21]:
# Creating series dataset
series_dat = pd.Series(np.random.rand(10))

In [22]:
series_dat

0    0.857994
1    0.271260
2    0.838537
3    0.693725
4    0.213506
5    0.948720
6    0.961665
7    0.126260
8    0.984471
9    0.109479
dtype: float64

In [23]:
# Creating dataframe
dataframe_dat = pd.DataFrame(np.random.rand(10,5), np.arange(10))

In [24]:
dataframe_dat

          0         1         2         3         4
0  0.765843  0.179542  0.653478  0.941646  0.995229
1  0.132703  0.789431  0.186157  0.534770  0.013044
2  0.522822  0.017925  0.072543  0.480303  0.460638
3  0.025410  0.823509  0.025977  0.333833  0.420062
4  0.969402  0.948555  0.023435  0.572100  0.857241
5  0.810827  0.934343  0.974645  0.255723  0.917754
6  0.343431  0.545870  0.888249  0.731574  0.931938
7  0.338302  0.848158  0.820938  0.568550  0.270167
8  0.177404  0.827337  0.043814  0.048183  0.817475
9  0.967985  0.459946  0.143846  0.211800  0.006351

In [25]:
type(dataframe_dat) #pandas.core.frame.DataFrame
type(series_dat)    #pandas.core.series.Series

pandas.core.series.Series

In [26]:
#Finding out type of data in every column of dataset
dataframe_dat.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
#printing all the index of dataset
dataframe_dat.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [28]:
#printing all the columns of dataset
dataframe_dat.columns

RangeIndex(start=0, stop=5, step=1)

In [29]:
# Converting the whole dataset two numpy array
dataframe_dat.to_numpy()

array([[0.765843  , 0.17954174, 0.65347775, 0.94164576, 0.99522863],
       [0.13270344, 0.78943063, 0.18615657, 0.53476955, 0.01304439],
       [0.52282209, 0.01792541, 0.07254297, 0.48030299, 0.46063827],
       [0.02540959, 0.82350912, 0.02597687, 0.33383268, 0.42006208],
       [0.96940178, 0.94855493, 0.02343493, 0.57209959, 0.85724137],
       [0.81082714, 0.93434341, 0.97464464, 0.25572266, 0.91775435],
       [0.34343119, 0.54587022, 0.88824874, 0.73157416, 0.93193798],
       [0.33830157, 0.84815798, 0.82093799, 0.56855012, 0.2701672 ],
       [0.17740353, 0.82733672, 0.0438144 , 0.04818265, 0.81747512],
       [0.96798475, 0.45994556, 0.14384558, 0.21180049, 0.00635086]])

In [30]:
#Transposing the whole dataset
dataframe_dat.T

,0,1,2,3,4,5,6,7,8,9
0,0.765843,0.132703,0.522822,0.025410,0.969402,0.810827,0.343431,0.338302,0.177404,0.967985
1,0.179542,0.789431,0.017925,0.823509,0.948555,0.934343,0.545870,0.848158,0.827337,0.459946
2,0.653478,0.186157,0.072543,0.025977,0.023435,0.974645,0.888249,0.820938,0.043814,0.143846
3,0.941646,0.534770,0.480303,0.333833,0.572100,0.255723,0.731574,0.568550,0.048183,0.211800
4,0.995229,0.013044,0.460638,0.420062,0.857241,0.917754,0.931938,0.270167,0.817475,0.006351

# 29:40